12/data/attachments/4722754c47a9d8b2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_19249d94-f068-4de5-aefb-eeb0eb80a5e8</nif:username>
            <nif:friendToBeAdded>Monica_rich_Friend_4141_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>